wingMotion2D_simpleFoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         3000;

deltaT          1;

writeControl    runTime;

writeInterval   100;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    forces
    {
        type                forces;
        libs                ("libforces.so");
        writeControl        timeStep;
        writeInterval       10;
        patches             (wing_main flap);
        rho                 rhoInf;
        log                 true;
        rhoInf              1.225;
        CofR                (0.25 0.007 0.125);
    }

    forceCoeffs
    {
        type                forceCoeffs;
        libs                ("libforces.so");
        writeControl        timeStep;
        writeInterval       10;
        patches             (wing_main flap);
        rho                 rhoInf;
        log                 true;
        rhoInf              1.225;
        magUInf             80;
        lRef                1;
        Aref                0.05;
        CofR                (0.25 0.007 0.125);
        liftDir             (0 1 0);
        dragDir             (1 0 0);
        pitchAxis           (0 0 1);
    }

yPlus
    {
        type            yPlus;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
        patches         (wing_main flap); // <--- ATTENZIONE: metti qui il nome esatto della patch del tuo profilo alare
    }
}


// ************************************************************************* //
